# ImageTypeOptions Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ImageTypeOptions Properties
ImageTypeOptions Class See Also
---
The ImageTypeOptions type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| PageNumber | The page in the file to be used for the image |
| Path | The path of the file that specifies the image to be used. |
| Resolution | The Resolution of the image is expressed in dots-per-inch and hence determines the size of a pixel in the image. |
| SourceType | Indicates whether the image type is a link or an import. |

# See Also
ImageTypeOptions Class
Autodesk.Revit.DB Namespace